---
kind: type
id: T:Autodesk.Revit.DB.DetailCurveArrayIterator
source: html/4ce2bcce-c98c-6efd-ab1e-761b1bc5bc31.htm
---
# Autodesk.Revit.DB.DetailCurveArrayIterator

An iterator to a array.

## Syntax (C#)
```csharp
public abstract class DetailCurveArrayIterator : APIObject,
	IEnumerator
```